[
    {
        "item_category_id": 30, 
        "designation": "ullamco voluptate labore veniam duis sint exercitation", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Et ad nisi cillum adipisicing veniam excepteur ea irure anim aliquip nostrud nostrud voluptate. Deserunt velit irure ea irure magna sint anim nisi ut dolor ut aute. Anim culpa irure amet ex id adipisicing dolor esse veniam.\r\nQuis anim non sit voluptate in exercitation anim est consectetur ea. Duis ipsum enim eiusmod adipisicing pariatur proident ad. Anim Lorem reprehenderit Lorem cillum sit id nostrud quis nostrud. Aliqua duis excepteur ullamco magna eu nulla anim amet fugiat consequat dolor cillum. Reprehenderit in labore aliquip ipsum qui voluptate laboris excepteur cupidatat tempor dolor amet eiusmod exercitation.\r\n", 
        "vente": 0, 
        "prix": 80, 
        "ref": "a945b500-4e6b-41ce-b558-ac4a7212b532", 
        "id": 0, 
        "stock": 19
    }, 
    {
        "item_category_id": 11, 
        "designation": "voluptate culpa non sint nulla ullamco eiusmod", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Aliqua amet velit amet cupidatat in sint quis exercitation voluptate ipsum ad ut eu. Esse dolor in consequat est veniam aliqua ut deserunt amet. Et fugiat excepteur anim cupidatat velit officia pariatur occaecat voluptate quis et cillum incididunt.\r\nEu ea ad non esse cupidatat. Officia ipsum officia ea nostrud fugiat sit officia pariatur. Ipsum amet do et voluptate elit. Sint dolor veniam velit est adipisicing. Reprehenderit Lorem est ea est.\r\n", 
        "vente": 0, 
        "prix": 101, 
        "ref": "e6b823b2-bdc0-49c4-8049-2cd4b1b29ca5", 
        "id": 1, 
        "stock": 22
    }, 
    {
        "item_category_id": 9, 
        "designation": "id proident eiusmod id voluptate excepteur commodo", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Enim aliquip do est sunt aliquip. Est ad exercitation nulla et dolor deserunt ipsum est fugiat et pariatur. Voluptate anim ad aute laboris nisi in ea voluptate do officia quis anim. Cupidatat occaecat velit aliquip minim aliquip nostrud officia ipsum sint sit exercitation culpa qui. Cupidatat excepteur sunt aliquip culpa labore amet ad irure do nostrud nulla nisi mollit nisi. Ad minim dolore amet ea minim ut occaecat esse velit id.\r\nOccaecat officia officia sit dolore do Lorem veniam elit deserunt dolore veniam irure. Ullamco dolore ullamco mollit est occaecat. Do sint dolore duis proident do Lorem do sunt.\r\n", 
        "vente": 0, 
        "prix": 331, 
        "ref": "6e4ba8ad-1985-4a67-ae21-41910eabe2f5", 
        "id": 2, 
        "stock": 8
    }, 
    {
        "item_category_id": 20, 
        "designation": "Lorem do nostrud adipisicing officia sunt nulla", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Consequat excepteur qui quis est non culpa aliqua officia consectetur et anim. Veniam cillum est anim ex et minim cillum ad tempor dolore. Est officia sunt irure nostrud irure excepteur velit. Amet ex sunt laborum esse cillum do. Veniam ex proident nisi ut mollit ut magna. Aliquip dolore mollit culpa eu laborum.\r\nNostrud velit ut duis consequat cillum aute cupidatat deserunt incididunt aliqua elit consequat est eu. Reprehenderit aute ullamco velit ad culpa culpa quis est laboris do ad consequat. In ea commodo esse anim commodo. Ipsum minim ullamco qui proident et voluptate. Culpa sit veniam nisi incididunt mollit. Occaecat velit cillum aliquip dolore do Lorem fugiat duis.\r\n", 
        "vente": 0, 
        "prix": 114, 
        "ref": "a8632958-c3bd-4941-bb6d-60d9701a93a8", 
        "id": 3, 
        "stock": 24
    }, 
    {
        "item_category_id": 15, 
        "designation": "reprehenderit cupidatat enim eiusmod ullamco laborum veniam", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Elit incididunt exercitation enim qui veniam laboris. Qui qui laboris exercitation laborum ex excepteur culpa duis dolor et cupidatat voluptate ad. Voluptate et sint dolore sint sit dolore do nostrud consequat excepteur id proident laborum. Laboris aliqua in adipisicing pariatur aute deserunt consequat qui. Reprehenderit do sit tempor commodo occaecat enim.\r\nMinim consectetur occaecat do consectetur sint reprehenderit excepteur adipisicing. Ad eiusmod minim dolor irure. Officia cillum esse esse labore sit ex ullamco aliqua irure reprehenderit incididunt ullamco. Excepteur ipsum mollit aute reprehenderit culpa dolor nostrud do proident ex quis. Sit ea aute ut veniam id enim.\r\n", 
        "vente": 0, 
        "prix": 436, 
        "ref": "c9492c47-bb42-4362-ba18-ef781d894b66", 
        "id": 4, 
        "stock": 15
    }, 
    {
        "item_category_id": 12, 
        "designation": "ex do cillum fugiat pariatur excepteur tempor", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Nulla enim eiusmod irure sint in cillum incididunt. Sint veniam Lorem exercitation sit esse irure Lorem cupidatat aliqua tempor esse consequat laborum elit. Amet duis ea ullamco enim ut officia eu adipisicing quis occaecat veniam amet. Tempor veniam sunt officia adipisicing dolore Lorem. Sint Lorem sint minim magna cillum ex magna officia velit. Ea aliquip est elit aliqua mollit aliqua enim minim nostrud.\r\nLaborum consectetur ad ex quis aliqua proident. Sit reprehenderit nisi do laborum irure proident mollit esse dolore velit reprehenderit laboris veniam commodo. Laborum qui pariatur consequat excepteur Lorem eiusmod nulla elit irure culpa laboris est qui. Proident consectetur duis eu eu aliquip qui qui ut voluptate veniam. Aute incididunt minim sint sit aliquip minim voluptate quis.\r\n", 
        "vente": 0, 
        "prix": 416, 
        "ref": "c8612885-5419-49c1-8905-1d4ea0380fae", 
        "id": 5, 
        "stock": 46
    }, 
    {
        "item_category_id": 2, 
        "designation": "dolore ipsum incididunt ut eiusmod ullamco nulla", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Magna anim culpa Lorem excepteur irure. Sint proident dolor velit proident. Non laborum laboris laboris duis cillum. Dolore laborum ad proident elit duis commodo proident. Qui nisi minim incididunt incididunt. Id deserunt laborum elit Lorem nulla dolor laboris amet.\r\nIrure laborum officia quis aliquip ut ipsum deserunt. Ex duis ullamco mollit laboris occaecat nulla nostrud consequat deserunt velit. In eu laborum adipisicing nostrud id aute aute nisi reprehenderit excepteur veniam officia cillum. Ut cupidatat mollit voluptate non officia laborum magna non incididunt ea ullamco.\r\n", 
        "vente": 0, 
        "prix": 381, 
        "ref": "414a2ecb-d619-4c27-8917-579e80e8f18c", 
        "id": 6, 
        "stock": 30
    }, 
    {
        "item_category_id": 19, 
        "designation": "duis occaecat non fugiat cillum ut deserunt", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Enim amet officia aute aliquip sunt consequat dolor eu veniam nisi velit officia. Quis irure consectetur tempor dolore occaecat velit veniam amet pariatur et. Sunt qui laboris consectetur voluptate magna aliquip. Cupidatat non id ea fugiat. Amet sit est nisi irure proident ullamco amet sit ullamco sit ex consectetur laborum. Officia ea proident cupidatat anim culpa consectetur.\r\nIn qui duis magna dolor. Eiusmod consequat fugiat tempor labore eu nulla est. Aute voluptate esse ullamco deserunt nisi tempor nisi.\r\n", 
        "vente": 0, 
        "prix": 144, 
        "ref": "7cc3a539-aa74-42e0-9c74-e95625373497", 
        "id": 7, 
        "stock": 50
    }, 
    {
        "item_category_id": 24, 
        "designation": "consequat tempor velit laboris consectetur do sint", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Amet exercitation pariatur aliquip magna velit elit deserunt nisi. Eu aliqua id anim commodo. Aute ullamco Lorem aliquip sit cillum fugiat incididunt. Excepteur magna occaecat Lorem ut. Quis labore velit minim quis exercitation cillum do minim aute voluptate nulla eiusmod tempor occaecat.\r\nTempor fugiat sunt adipisicing sit. Officia fugiat eu veniam labore dolor ullamco cillum eiusmod commodo nostrud. Aute Lorem magna veniam laborum amet adipisicing aliqua. Eiusmod non non aliqua laborum consectetur veniam labore fugiat duis dolor est cupidatat. Veniam ea eiusmod culpa in eu laboris ut sit ipsum consequat occaecat ex.\r\n", 
        "vente": 0, 
        "prix": 402, 
        "ref": "d11d28a3-9379-418c-9807-735aa4850211", 
        "id": 8, 
        "stock": 36
    }, 
    {
        "item_category_id": 15, 
        "designation": "tempor amet nisi sint id sint dolore", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Magna eu laboris adipisicing incididunt anim excepteur adipisicing ad esse. Minim laborum sit aliquip in et. Tempor voluptate laboris consectetur dolore labore voluptate commodo. Irure ad anim ut deserunt magna Lorem duis. In ipsum labore aute ex dolore voluptate anim occaecat laborum aliqua sit.\r\nCupidatat velit ad ex pariatur commodo sint. Cillum sint magna consequat elit id sit magna amet ut in aute incididunt sint est. Pariatur adipisicing ipsum in Lorem dolor labore laboris duis consequat laborum occaecat do anim id. Voluptate nulla eiusmod Lorem nisi ex esse voluptate. Dolor velit ad enim fugiat.\r\n", 
        "vente": 0, 
        "prix": 488, 
        "ref": "e7b433fd-0acd-4ee0-8482-4bafc3f104a2", 
        "id": 9, 
        "stock": 34
    }, 
    {
        "item_category_id": 15, 
        "designation": "nisi mollit aliqua duis exercitation fugiat minim", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Enim Lorem minim deserunt magna eiusmod eiusmod proident cillum. Nulla commodo consequat magna exercitation fugiat mollit et excepteur sunt eiusmod. Labore laboris amet nostrud elit in aliqua qui proident proident. Cupidatat labore consectetur consequat laboris officia magna consequat eu enim. Do et mollit ipsum occaecat. Nostrud velit mollit sint velit commodo ex laborum nisi eiusmod. Exercitation culpa eiusmod sit ex laboris voluptate ex eiusmod minim officia cupidatat proident deserunt elit.\r\nCillum deserunt pariatur sit exercitation velit tempor velit ipsum laboris. Aliqua adipisicing id culpa culpa non est. Aliqua reprehenderit velit est esse consectetur nostrud excepteur ullamco commodo ullamco. Eu occaecat dolore ad laboris ad eiusmod duis consectetur sunt aute proident ad est ipsum. Nostrud cupidatat in ipsum proident. Id magna occaecat velit sint veniam consequat fugiat enim proident.\r\n", 
        "vente": 0, 
        "prix": 493, 
        "ref": "d130e63f-fcd7-4269-a5a9-30a1ca9e08ee", 
        "id": 10, 
        "stock": 6
    }, 
    {
        "item_category_id": 26, 
        "designation": "non exercitation culpa ea elit anim velit", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Amet laboris reprehenderit tempor voluptate ipsum. Dolor mollit ullamco eu nostrud non magna. Tempor veniam duis consectetur culpa eiusmod aliqua non qui ullamco. Ea ea laboris deserunt ad ullamco quis magna dolor magna est. Deserunt aute ex incididunt laborum sunt proident amet anim aute velit aliquip cillum sit. Aliquip fugiat enim irure deserunt occaecat consectetur laborum anim id ex ipsum nulla aliqua. Tempor qui excepteur duis enim sint Lorem minim elit deserunt sit.\r\nLorem occaecat non ullamco non deserunt velit non et reprehenderit eu. Mollit ut deserunt cillum aliqua magna aliquip dolore fugiat anim ullamco consectetur amet. Ex in irure id dolore consequat ad dolore Lorem. Cupidatat commodo ex eu exercitation. Sit eiusmod dolore nulla eu laboris dolor aliquip sunt aliquip laborum aliquip occaecat.\r\n", 
        "vente": 0, 
        "prix": 442, 
        "ref": "1dd7208d-1768-4d24-87ed-115ee4d0ea31", 
        "id": 11, 
        "stock": 29
    }, 
    {
        "item_category_id": 26, 
        "designation": "Lorem officia occaecat irure commodo ipsum voluptate", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Incididunt voluptate excepteur nisi nulla sint ullamco sunt et pariatur mollit esse. Tempor qui proident id tempor irure elit commodo est sit mollit reprehenderit sit nulla ad. Exercitation occaecat duis nisi consectetur tempor Lorem dolore nisi duis ad.\r\nMollit et Lorem pariatur do officia aliqua nulla. Nostrud ullamco sit voluptate ex Lorem proident aute aliquip anim cupidatat. Lorem laborum occaecat eu Lorem laboris nisi et.\r\n", 
        "vente": 0, 
        "prix": 155, 
        "ref": "2c4acff5-77d5-4cf4-b81c-715395191bbb", 
        "id": 12, 
        "stock": 2
    }, 
    {
        "item_category_id": 19, 
        "designation": "id eiusmod consequat mollit mollit culpa anim", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Sint duis non commodo aute deserunt et pariatur officia sunt veniam et. Aliqua est velit amet voluptate. Nisi non irure quis quis esse mollit incididunt eu duis reprehenderit aliquip. Quis ex irure veniam aliqua ex nostrud tempor fugiat fugiat anim dolore excepteur amet consequat. Dolor cillum laborum laboris nulla labore commodo consectetur culpa deserunt magna exercitation excepteur. Eu voluptate magna nulla proident veniam id in adipisicing. Deserunt incididunt anim anim eiusmod do proident velit anim cillum aute ullamco culpa mollit non.\r\nVelit aliqua nulla enim qui culpa sunt adipisicing duis ea id sint. Dolore dolor consectetur aliquip ea ullamco enim exercitation dolore sit ex consectetur occaecat. Officia occaecat id incididunt labore proident excepteur sunt culpa do aute irure. Deserunt exercitation ullamco aute eu. Lorem id qui aliquip ullamco id fugiat aute ullamco culpa culpa aliqua sit cillum.\r\n", 
        "vente": 0, 
        "prix": 59, 
        "ref": "424949f6-411f-4c11-9c72-98a276a43b16", 
        "id": 13, 
        "stock": 10
    }, 
    {
        "item_category_id": 21, 
        "designation": "laborum aliqua incididunt ex do occaecat cupidatat", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Ipsum proident duis qui sit et. Laborum in culpa commodo reprehenderit aliqua nulla proident voluptate mollit ullamco sit in. Cupidatat laboris incididunt ut voluptate nulla.\r\nEnim nisi aliqua amet qui sit voluptate amet sit Lorem aliquip deserunt aliqua ut Lorem. Consequat id exercitation dolore dolore tempor. Pariatur deserunt ullamco et nostrud consectetur deserunt enim ad ut. Reprehenderit labore adipisicing dolor qui aute ut nisi. Et duis consectetur consectetur sit duis.\r\n", 
        "vente": 0, 
        "prix": 261, 
        "ref": "110f91b3-e224-4da8-bb7d-b965c11e6c52", 
        "id": 14, 
        "stock": 24
    }, 
    {
        "item_category_id": 22, 
        "designation": "sunt et ut et dolor quis voluptate", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Consequat non tempor sint laboris aliquip pariatur nisi minim fugiat occaecat tempor aute quis. Velit non elit quis nostrud esse quis. Proident veniam sint eu id adipisicing.\r\nNisi cillum duis est eu ut tempor. Id deserunt anim nisi aliqua aute amet enim ea nulla dolor tempor consequat ullamco in. Laborum exercitation non Lorem exercitation commodo ipsum tempor. Et sit irure labore incididunt dolor. Anim eiusmod dolor aute incididunt ea id incididunt aliqua irure elit in. Quis eu tempor cupidatat est ipsum pariatur eiusmod aliquip non. Adipisicing nulla sunt ea exercitation tempor sunt ullamco officia est esse exercitation consequat dolore.\r\n", 
        "vente": 0, 
        "prix": 303, 
        "ref": "4086aec5-eff8-40bb-bcd3-e0f1f7ba1fd1", 
        "id": 15, 
        "stock": 23
    }, 
    {
        "item_category_id": 12, 
        "designation": "velit consequat voluptate officia qui reprehenderit nisi", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Ut ad ea qui enim commodo esse fugiat. Ex tempor culpa id labore excepteur. Esse proident ad culpa fugiat laboris magna. Aute reprehenderit Lorem et laborum qui mollit Lorem aute. Qui pariatur deserunt sit excepteur enim sit eu ea. Nulla dolor sint culpa eiusmod irure labore nisi non eiusmod velit sint officia esse deserunt.\r\nSit occaecat ad veniam sit adipisicing dolor voluptate adipisicing aliqua. Reprehenderit ullamco ea veniam laboris aliqua culpa laborum proident ullamco fugiat. Amet qui excepteur minim dolor nulla laboris cupidatat excepteur quis eu esse ex. Magna ea magna occaecat nulla laboris non labore proident pariatur nulla dolore aute.\r\n", 
        "vente": 0, 
        "prix": 17, 
        "ref": "c6ef983e-426e-40ce-8cc0-2f2a01d3dded", 
        "id": 16, 
        "stock": 4
    }, 
    {
        "item_category_id": 13, 
        "designation": "irure nostrud magna ipsum cupidatat et consequat", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Culpa deserunt ut officia commodo sunt in irure sint commodo ea cillum sunt ea. Sit incididunt fugiat nulla aliqua elit irure. Cillum laboris ullamco aute id velit cupidatat ullamco officia et duis nulla voluptate consectetur. Lorem ut occaecat deserunt enim do. Aute veniam et pariatur consequat Lorem incididunt amet duis qui. Ipsum aliqua anim id est laborum ipsum elit non sit aliqua elit.\r\nAmet tempor laborum sint sint ea anim id consectetur ipsum. Enim aliquip elit nisi ad et dolor. Nisi id do magna ut consequat sint adipisicing sit cillum duis pariatur. Sint pariatur reprehenderit mollit pariatur nisi laborum laborum eu laborum Lorem in. Aute aliquip aliqua ullamco in. Cupidatat enim voluptate voluptate sint quis officia laboris irure ex Lorem in fugiat.\r\n", 
        "vente": 0, 
        "prix": 455, 
        "ref": "b5192309-b27d-4b33-97a4-f0efb8819cd6", 
        "id": 17, 
        "stock": 49
    }, 
    {
        "item_category_id": 8, 
        "designation": "Lorem officia enim nisi ad ullamco et", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Irure do id dolore laborum. Anim minim laboris veniam exercitation minim incididunt laborum sit exercitation aliqua consequat anim amet excepteur. Eiusmod ea quis Lorem voluptate Lorem enim ad occaecat sint duis commodo cupidatat.\r\nDo deserunt ipsum fugiat adipisicing ut eu laboris officia. Fugiat duis cillum nulla velit deserunt Lorem ex amet Lorem laborum veniam nulla. Et duis laboris duis nostrud irure. Amet nisi id labore excepteur est amet occaecat enim ea magna ex sunt est. Qui reprehenderit nisi ipsum ad culpa enim in adipisicing.\r\n", 
        "vente": 0, 
        "prix": 276, 
        "ref": "452b1666-81eb-4f3c-b83a-23fbfe00c211", 
        "id": 18, 
        "stock": 6
    }, 
    {
        "item_category_id": 27, 
        "designation": "quis nostrud ad ea sit labore mollit", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Magna consequat elit dolor sunt id id voluptate commodo quis sit. Sit duis nulla irure anim esse esse magna voluptate in. Reprehenderit cupidatat Lorem aliquip occaecat minim labore magna enim ullamco reprehenderit pariatur non duis aliquip. Elit commodo aliquip excepteur ex labore enim voluptate ea et. Exercitation sunt ex amet qui reprehenderit officia proident.\r\nElit aute sint ut laborum mollit magna minim ullamco commodo laborum. Ullamco do sit do enim ullamco reprehenderit pariatur cillum enim id excepteur enim adipisicing. Non aliquip magna esse deserunt. Dolore ad exercitation amet voluptate occaecat sit mollit. Quis in eiusmod exercitation velit culpa nulla eu qui tempor. Adipisicing amet cupidatat consectetur aliqua magna.\r\n", 
        "vente": 0, 
        "prix": 58, 
        "ref": "6ad88375-2d5b-460b-9b8e-3c974719961d", 
        "id": 19, 
        "stock": 9
    }, 
    {
        "item_category_id": 28, 
        "designation": "aliqua qui qui commodo dolore proident aute", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Cupidatat do nostrud magna eiusmod veniam eu commodo incididunt. Reprehenderit sint commodo exercitation occaecat quis qui velit. Amet labore cupidatat exercitation veniam reprehenderit aliqua ex cillum ut voluptate nostrud sunt laboris ut. Eu sit in reprehenderit cillum qui proident minim aute laboris deserunt aute.\r\nSint sint nisi nostrud consectetur. Et in mollit cupidatat adipisicing ad magna. Ea dolor nostrud deserunt laboris sunt. Consectetur labore officia est quis eu laborum ut. Sunt anim irure labore proident incididunt officia sint reprehenderit nisi commodo eiusmod cupidatat qui minim.\r\n", 
        "vente": 0, 
        "prix": 413, 
        "ref": "64efdd1d-cf3b-4631-a867-05fc622f2605", 
        "id": 20, 
        "stock": 16
    }, 
    {
        "item_category_id": 15, 
        "designation": "sint cillum sit ut minim dolor aliquip", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Proident amet occaecat tempor voluptate mollit cillum amet consectetur. Nulla laborum amet ut laborum ad amet laborum tempor nulla est aliquip qui cupidatat dolor. Ullamco ullamco quis irure mollit sint quis. Consequat veniam occaecat deserunt officia est eiusmod duis do et. Veniam velit ipsum anim exercitation ipsum. Enim elit tempor exercitation aliqua et.\r\nIncididunt irure minim adipisicing incididunt minim aliqua excepteur qui. Nisi eiusmod non quis qui. Laborum anim anim commodo id veniam id esse voluptate ipsum laborum duis cupidatat magna. Proident aute minim nisi non eu qui ad aliqua. Veniam amet esse ex aliqua consectetur in Lorem qui duis fugiat. Laboris esse in et proident voluptate Lorem non magna aliqua ea sit culpa fugiat. Anim exercitation cupidatat tempor adipisicing eu esse excepteur proident est nisi.\r\n", 
        "vente": 0, 
        "prix": 16, 
        "ref": "328b1bfd-dd9a-4b8b-ba52-920e53fef574", 
        "id": 21, 
        "stock": 41
    }, 
    {
        "item_category_id": 14, 
        "designation": "labore labore commodo culpa cillum sunt laboris", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Ad non veniam proident culpa minim. Nisi deserunt eu excepteur enim excepteur amet irure qui voluptate pariatur laborum reprehenderit cillum. Anim et consectetur dolore dolor commodo do cillum velit. Sint exercitation mollit cillum tempor elit nisi fugiat sunt est sint. Adipisicing ex esse amet tempor ullamco veniam ullamco labore qui esse veniam proident veniam in. Cupidatat proident sit aliquip irure irure consectetur incididunt elit ex reprehenderit cupidatat aliqua ea sunt. Irure est minim quis quis adipisicing nulla est.\r\nId dolor voluptate ad incididunt deserunt aute. Eu eiusmod esse Lorem duis incididunt ullamco laborum. Qui nisi ad esse cupidatat excepteur nulla sunt eu. Eiusmod cillum fugiat sunt aliqua officia fugiat Lorem est commodo amet duis dolor. Mollit nulla amet veniam consectetur officia ut proident id laborum nisi.\r\n", 
        "vente": 0, 
        "prix": 267, 
        "ref": "640f1580-eee7-412b-878d-e608a9f1d151", 
        "id": 22, 
        "stock": 0
    }, 
    {
        "item_category_id": 6, 
        "designation": "exercitation aute esse deserunt laboris velit ullamco", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Adipisicing ut exercitation qui in voluptate cillum fugiat enim reprehenderit sunt. Veniam ex pariatur laboris labore eiusmod ullamco irure aliquip irure. Eu ea aliqua exercitation sint nulla consequat incididunt sunt mollit nisi excepteur ullamco.\r\nNulla culpa elit proident sit amet nostrud sint duis. Veniam non aliquip adipisicing excepteur labore. Id ad laborum irure ipsum cupidatat adipisicing in labore dolor reprehenderit est mollit proident. Cillum sunt fugiat ipsum ex cupidatat esse officia excepteur aliquip est. Qui tempor minim ea elit laborum ad culpa aliqua.\r\n", 
        "vente": 0, 
        "prix": 165, 
        "ref": "8aefd263-7edf-45f4-99c4-8fe6c04ed677", 
        "id": 23, 
        "stock": 23
    }, 
    {
        "item_category_id": 4, 
        "designation": "cillum est ad est ipsum ut enim", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Quis quis nisi officia voluptate qui. Duis duis ad nostrud minim excepteur ex aute aliqua. Fugiat elit esse fugiat sunt est nulla. Eu deserunt mollit culpa minim laboris mollit fugiat est irure voluptate velit. Cillum aute laboris voluptate laboris quis id nisi mollit magna nisi anim. Laboris sunt elit esse aliquip sunt dolore ut consectetur cupidatat et eiusmod reprehenderit.\r\nDolore nostrud in in anim. Occaecat duis veniam nisi eiusmod aliqua commodo ex enim. Sit magna anim officia dolore est. Deserunt dolore sit pariatur qui. Exercitation ipsum proident quis non veniam reprehenderit adipisicing irure sit. Mollit nostrud aliquip ex consequat velit in fugiat. Nisi duis consequat excepteur irure aute laborum ullamco reprehenderit qui aliquip aliquip magna veniam exercitation.\r\n", 
        "vente": 0, 
        "prix": 248, 
        "ref": "01f0fe30-d31d-4fb5-bcfc-2dead50dd358", 
        "id": 24, 
        "stock": 23
    }, 
    {
        "item_category_id": 21, 
        "designation": "aliquip id consectetur irure dolor excepteur eu", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Fugiat eiusmod laborum nisi duis occaecat amet dolor adipisicing. Deserunt consectetur ex excepteur laboris anim non duis ex ullamco consequat commodo anim. Non incididunt consectetur eu labore minim amet in mollit ad. Non tempor occaecat commodo anim sit aute exercitation qui mollit consequat consectetur. Qui et anim commodo laboris nisi ad eiusmod exercitation incididunt enim ullamco.\r\nCupidatat magna quis exercitation aliquip esse enim ad non ad aliqua velit eu. Officia eu consequat cupidatat dolor ad esse ullamco. Est dolore ad pariatur nostrud qui.\r\n", 
        "vente": 0, 
        "prix": 442, 
        "ref": "ea4a2273-42ec-4bdc-b8a8-ebd598db096f", 
        "id": 25, 
        "stock": 7
    }, 
    {
        "item_category_id": 9, 
        "designation": "aliqua minim reprehenderit minim reprehenderit elit cillum", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Ipsum duis qui ea commodo esse non do aute enim laborum fugiat ipsum. Laborum do exercitation minim reprehenderit minim occaecat tempor tempor culpa sunt. Dolor deserunt esse voluptate laboris ex dolor deserunt et non voluptate cupidatat velit. Reprehenderit nostrud ipsum quis exercitation. Labore in laboris proident esse eiusmod labore exercitation ea eu.\r\nIrure deserunt sint culpa deserunt culpa est eu nisi ad adipisicing enim. Et ex tempor ut tempor aliquip est dolore dolor nostrud exercitation occaecat. Ad occaecat labore enim sunt consectetur amet voluptate dolore eiusmod excepteur esse reprehenderit. Cillum officia duis aliqua esse eiusmod magna Lorem pariatur aliqua. Voluptate nisi est eu reprehenderit sit ad laboris fugiat tempor non. Culpa anim id ipsum in. Minim pariatur laboris dolor consectetur commodo consectetur adipisicing commodo officia labore ea.\r\n", 
        "vente": 0, 
        "prix": 403, 
        "ref": "81186b4f-8b5f-41c8-87bd-4198a50aadf0", 
        "id": 26, 
        "stock": 4
    }, 
    {
        "item_category_id": 14, 
        "designation": "occaecat aliqua tempor ex ad Lorem quis", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Ipsum ad reprehenderit dolore anim excepteur excepteur ad Lorem aliqua. Tempor non consequat velit et dolore consequat anim id pariatur aliqua exercitation eu nisi sunt. Dolore nostrud est sint anim tempor minim nulla tempor officia velit ut occaecat pariatur. Ut voluptate non dolore id occaecat ut cupidatat culpa duis eu.\r\nNostrud et veniam amet ut occaecat velit id. Ut eiusmod nulla labore commodo duis sint Lorem. Velit quis magna dolor ipsum deserunt nostrud. Deserunt nostrud in commodo nostrud enim voluptate laborum ex veniam eu.\r\n", 
        "vente": 0, 
        "prix": 339, 
        "ref": "e388e31e-3412-40b0-97e1-d73701e53f6e", 
        "id": 27, 
        "stock": 47
    }, 
    {
        "item_category_id": 30, 
        "designation": "commodo ex dolore consequat enim officia ut", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Labore voluptate Lorem laboris ea irure. Sunt reprehenderit deserunt proident culpa deserunt aliquip laboris enim fugiat sunt. Do ea aliqua consequat commodo id ut. Excepteur culpa velit ea fugiat duis voluptate pariatur cillum labore. In incididunt elit ullamco deserunt.\r\nOfficia officia esse quis quis deserunt tempor ut id qui eiusmod adipisicing. Esse consectetur non nostrud amet occaecat exercitation reprehenderit esse velit reprehenderit. Pariatur aliquip qui quis pariatur. Consequat magna et proident proident est.\r\n", 
        "vente": 0, 
        "prix": 117, 
        "ref": "5277d284-5755-47d1-ae90-4f946e959577", 
        "id": 28, 
        "stock": 33
    }, 
    {
        "item_category_id": 16, 
        "designation": "sit et minim cupidatat cupidatat aute labore", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Mollit qui reprehenderit eu non et velit quis incididunt tempor. Anim veniam aute est adipisicing officia nisi excepteur ex ut est irure eu. Anim et voluptate commodo cupidatat non commodo occaecat id in. Veniam quis minim esse culpa exercitation. Exercitation velit ex ea officia occaecat qui est aliqua ut cillum.\r\nAnim enim sit anim reprehenderit ad dolore reprehenderit duis excepteur ipsum dolore. Eu pariatur in duis ea veniam occaecat excepteur eu exercitation nulla id irure. Laboris tempor esse nostrud ipsum incididunt nostrud.\r\n", 
        "vente": 0, 
        "prix": 342, 
        "ref": "c352634a-4bd1-4621-bf52-485c637b5206", 
        "id": 29, 
        "stock": 30
    }, 
    {
        "item_category_id": 24, 
        "designation": "proident amet do ut reprehenderit exercitation laborum", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Duis nulla anim officia magna. Laborum nulla non sunt magna in elit excepteur ex excepteur elit. In fugiat ea adipisicing duis. Esse eiusmod dolore ipsum incididunt ea exercitation quis. Sint anim dolor tempor duis consectetur nulla sunt. Et culpa eiusmod anim mollit incididunt aute incididunt in deserunt proident ad sunt.\r\nIn sit proident quis ex. Occaecat mollit commodo qui reprehenderit Lorem adipisicing est est veniam ut. Incididunt aute eiusmod cillum veniam in nulla reprehenderit ut sunt ex dolore. Nulla irure enim aliquip laboris consequat proident veniam labore est exercitation non anim cillum. Dolor voluptate aliquip qui quis magna.\r\n", 
        "vente": 0, 
        "prix": 247, 
        "ref": "eb515738-f06b-42f5-a624-186502491c31", 
        "id": 30, 
        "stock": 35
    }, 
    {
        "item_category_id": 5, 
        "designation": "labore dolor ex incididunt minim culpa cupidatat", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Aliquip elit excepteur veniam ut nostrud irure reprehenderit excepteur anim cupidatat id. Non occaecat sit nisi nisi fugiat reprehenderit do id minim. Sint minim nulla ea sunt Lorem. Reprehenderit sit occaecat dolor pariatur ex id anim quis laboris commodo sint amet. Tempor consequat quis irure cillum irure nostrud duis aliqua. Eu nisi exercitation deserunt veniam.\r\nIpsum non qui enim commodo dolore Lorem. Eu fugiat ut reprehenderit adipisicing anim aute occaecat laborum minim minim irure proident labore qui. Est dolore cillum esse cupidatat sint culpa officia Lorem ipsum excepteur.\r\n", 
        "vente": 0, 
        "prix": 73, 
        "ref": "9a3827d4-ab91-48f9-aa32-4a9e7e879710", 
        "id": 31, 
        "stock": 43
    }, 
    {
        "item_category_id": 5, 
        "designation": "voluptate quis dolore Lorem in dolor mollit", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Nostrud enim sint aute sunt exercitation qui. Non qui irure eiusmod ex minim consequat exercitation. Nisi aliquip sint laborum elit aliqua eiusmod dolore Lorem quis Lorem laborum consequat nisi. Eu ad amet dolore ipsum ipsum ea dolore qui aliqua pariatur. Aliqua voluptate incididunt exercitation ex qui. Culpa culpa ea ullamco nostrud nisi anim consectetur.\r\nMollit esse Lorem ipsum ullamco eiusmod mollit esse. Esse pariatur laboris occaecat officia. Dolore consequat officia ex culpa eu aliquip officia non laborum dolore laborum. Deserunt laboris proident nulla officia minim enim incididunt. Duis duis fugiat eiusmod sint.\r\n", 
        "vente": 0, 
        "prix": 379, 
        "ref": "9bbf695e-939c-4ea9-8014-169646e7cbfd", 
        "id": 32, 
        "stock": 16
    }, 
    {
        "item_category_id": 3, 
        "designation": "incididunt labore culpa culpa eiusmod qui laborum", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Sit consectetur tempor aliqua sit ut cillum. Aliquip anim aute sunt consectetur est exercitation esse minim eu irure quis. Fugiat qui enim qui aute ea elit cillum deserunt occaecat culpa exercitation est non est. Consequat aliquip pariatur laborum cupidatat veniam laborum sunt nisi aliqua nisi officia quis.\r\nCupidatat elit do nostrud ipsum. Exercitation anim voluptate quis exercitation esse deserunt do quis sit proident. Sit voluptate excepteur amet et enim cupidatat. Elit tempor non aute elit voluptate. Reprehenderit enim tempor aliquip anim minim incididunt occaecat eiusmod enim pariatur dolore nostrud Lorem.\r\n", 
        "vente": 0, 
        "prix": 360, 
        "ref": "541021be-2b2c-4fdd-8d76-f6ff271a8340", 
        "id": 33, 
        "stock": 18
    }, 
    {
        "item_category_id": 19, 
        "designation": "quis laboris cupidatat do nostrud et do", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Ipsum nostrud aliqua cupidatat incididunt nostrud officia quis quis incididunt elit esse officia. Tempor aliqua magna nostrud dolor consequat consequat cupidatat. Consequat aliquip excepteur sint et minim ullamco consequat deserunt Lorem ullamco deserunt.\r\nQuis ex ipsum nisi minim nisi occaecat tempor. Non sunt ea amet irure elit enim. Magna reprehenderit ipsum ad ea qui labore qui mollit mollit. Nisi Lorem do reprehenderit reprehenderit qui id exercitation amet.\r\n", 
        "vente": 0, 
        "prix": 452, 
        "ref": "1c7a3692-66c7-4f27-9a58-dc004a36e22f", 
        "id": 34, 
        "stock": 18
    }, 
    {
        "item_category_id": 26, 
        "designation": "duis velit duis proident eiusmod tempor nostrud", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Eiusmod deserunt magna aliqua proident aute est pariatur. Dolore ipsum nostrud id sint sit labore ad duis. Qui laborum fugiat adipisicing ea nulla enim nulla et amet velit esse dolore consectetur dolor.\r\nLaborum id magna anim excepteur. Proident mollit ipsum proident est ad laboris laborum cillum ipsum incididunt elit et nisi sit. Nisi veniam irure ad magna ut elit pariatur cupidatat.\r\n", 
        "vente": 0, 
        "prix": 296, 
        "ref": "4488ef8b-9475-4da0-9557-2e50163242d2", 
        "id": 35, 
        "stock": 0
    }, 
    {
        "item_category_id": 20, 
        "designation": "nisi veniam adipisicing eiusmod do minim anim", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Et cillum consequat dolor qui. Duis incididunt proident veniam officia incididunt deserunt in et qui ad. Officia veniam ipsum mollit reprehenderit minim eu id sit do minim consectetur officia est ut. Laborum cupidatat nisi consequat commodo deserunt. Esse dolore enim ad anim deserunt consectetur. Incididunt dolore cupidatat sunt ex sunt laboris commodo ea fugiat adipisicing labore. Eiusmod et eu officia aliquip qui cupidatat aliqua voluptate non voluptate magna fugiat magna fugiat.\r\nUllamco quis ex aute eiusmod commodo do excepteur magna. Excepteur voluptate sunt officia occaecat non dolore aliquip enim irure eiusmod. Dolore consequat voluptate dolor ut dolore elit. Voluptate labore tempor incididunt ad. Exercitation exercitation est cillum nisi quis deserunt nisi non incididunt aliquip. Aute duis culpa consectetur consequat dolor mollit aliqua elit eiusmod ipsum quis sint ea.\r\n", 
        "vente": 0, 
        "prix": 449, 
        "ref": "0e512a8d-639b-4d94-bc8d-cec8055832d1", 
        "id": 36, 
        "stock": 43
    }, 
    {
        "item_category_id": 16, 
        "designation": "in ipsum eu elit tempor magna minim", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Qui exercitation sint in ea excepteur ullamco nisi sit aute dolore irure. Commodo in culpa ea id labore eu occaecat. Mollit amet nisi nulla ipsum eu labore ex laborum quis exercitation occaecat ex velit.\r\nNulla quis fugiat ullamco Lorem veniam incididunt qui eu ea in labore tempor aute. Anim quis sint adipisicing et. Consequat aute elit consectetur sit dolore. Velit nisi voluptate nisi aliquip velit et exercitation velit magna laboris.\r\n", 
        "vente": 0, 
        "prix": 64, 
        "ref": "e6144781-9a68-4724-91e7-7fa175f76976", 
        "id": 37, 
        "stock": 31
    }, 
    {
        "item_category_id": 27, 
        "designation": "sit incididunt occaecat qui laborum do ad", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Id dolor qui nisi ut do ut ut dolore veniam ut labore elit nostrud aliquip. Sint aliqua ipsum qui ex excepteur cupidatat. Exercitation occaecat sunt non deserunt in anim.\r\nVelit enim esse est consequat id. Esse officia deserunt incididunt nulla tempor dolor ipsum magna. Do reprehenderit ea labore Lorem culpa dolore culpa labore. In enim tempor non amet mollit sint. Ad laboris ullamco exercitation cillum amet magna qui cillum exercitation quis excepteur exercitation cillum velit. Reprehenderit officia exercitation adipisicing adipisicing labore id.\r\n", 
        "vente": 0, 
        "prix": 12, 
        "ref": "0f3b77b1-885a-4221-b17f-9d1825d93f81", 
        "id": 38, 
        "stock": 40
    }, 
    {
        "item_category_id": 9, 
        "designation": "voluptate exercitation id quis dolore tempor Lorem", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Incididunt reprehenderit proident excepteur magna incididunt Lorem in dolore enim velit commodo. Aliqua sit deserunt ad id sit officia ea cupidatat reprehenderit sunt. Excepteur ea eiusmod consequat in incididunt duis tempor cupidatat anim velit magna dolore irure. Amet excepteur duis aliquip exercitation occaecat quis.\r\nLaboris quis Lorem eu tempor est deserunt cupidatat veniam. Esse proident non eu laboris sit Lorem et. Deserunt et ad occaecat cillum magna consequat. Est in veniam labore culpa est elit veniam. Adipisicing quis cupidatat fugiat aliqua. Incididunt excepteur dolor ad eiusmod do adipisicing dolore dolore laborum do Lorem reprehenderit do.\r\n", 
        "vente": 0, 
        "prix": 136, 
        "ref": "1f2d26f5-5f90-4dcb-b9be-23de6f13da68", 
        "id": 39, 
        "stock": 23
    }, 
    {
        "item_category_id": 9, 
        "designation": "id fugiat consectetur ex eu incididunt mollit", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Pariatur eu pariatur deserunt officia et elit culpa laboris eiusmod ad sint voluptate. Enim culpa officia cupidatat duis qui do nisi tempor qui velit. Voluptate exercitation et pariatur ad officia adipisicing enim. Ex sit ullamco non ex adipisicing non.\r\nAdipisicing irure eiusmod cupidatat dolore enim tempor occaecat. Veniam dolore est eiusmod voluptate qui non. Occaecat nisi consequat qui non ipsum veniam duis velit enim est non. Deserunt duis ex et labore do anim culpa ea voluptate veniam. Dolor ad quis commodo nisi officia consectetur sint ad. Magna officia nisi qui est duis ea commodo deserunt nisi velit. Dolor ex proident minim sunt dolor proident non pariatur laborum esse mollit.\r\n", 
        "vente": 0, 
        "prix": 272, 
        "ref": "8d455ae0-3e25-457b-98bf-ae76a4db0024", 
        "id": 40, 
        "stock": 24
    }, 
    {
        "item_category_id": 21, 
        "designation": "est proident consequat exercitation dolore magna enim", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Tempor veniam fugiat nisi consequat reprehenderit ipsum culpa do veniam excepteur duis cillum eiusmod duis. Ipsum adipisicing consequat excepteur et Lorem. Commodo veniam irure ullamco non eu. Eiusmod ipsum deserunt veniam enim officia reprehenderit qui ea. Consequat id ipsum incididunt reprehenderit esse magna sunt nisi velit consequat proident ea fugiat minim. Minim reprehenderit ullamco culpa excepteur voluptate adipisicing occaecat pariatur duis laborum excepteur sit enim.\r\nExercitation ullamco nulla eiusmod laboris reprehenderit. Labore id sint fugiat est occaecat elit aliqua aliquip cillum. Ea nostrud ea pariatur pariatur. Dolore quis id ex labore id aute amet.\r\n", 
        "vente": 0, 
        "prix": 269, 
        "ref": "929ca896-a218-4134-953b-bc6d35e6c6eb", 
        "id": 41, 
        "stock": 25
    }, 
    {
        "item_category_id": 10, 
        "designation": "fugiat tempor laborum velit excepteur aute aliqua", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Exercitation magna amet fugiat Lorem est nisi. Officia elit voluptate non ut excepteur amet officia. Ad cupidatat adipisicing dolor non. Consequat ipsum veniam qui incididunt sit sint voluptate sit cupidatat eu ut magna reprehenderit. Est veniam aliqua anim deserunt esse tempor ex.\r\nAdipisicing irure tempor sit cillum occaecat eiusmod. Aliqua sit cillum fugiat eu labore labore eiusmod sunt est aliquip veniam non sint aliqua. Proident est adipisicing proident exercitation dolor ea veniam ipsum in ut exercitation qui dolor.\r\n", 
        "vente": 0, 
        "prix": 83, 
        "ref": "e830a17e-e520-43b5-994c-70d4304d2770", 
        "id": 42, 
        "stock": 6
    }, 
    {
        "item_category_id": 5, 
        "designation": "veniam adipisicing pariatur nostrud enim aliqua in", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Enim cupidatat est reprehenderit amet. Velit consectetur sint irure ut labore minim. Non nostrud laborum minim sit ipsum ex. Dolore in excepteur aliquip non anim ipsum laboris do veniam sunt qui ipsum magna. Cupidatat ut eiusmod irure commodo voluptate non minim elit. Occaecat qui Lorem sint ea duis.\r\nNulla cillum cupidatat enim dolor irure. In adipisicing minim voluptate aute. Id non eu adipisicing esse quis dolore pariatur non id est laborum.\r\n", 
        "vente": 0, 
        "prix": 7, 
        "ref": "a807e660-f0f5-426b-bd0a-6956ddbc0afd", 
        "id": 43, 
        "stock": 38
    }, 
    {
        "item_category_id": 21, 
        "designation": "anim minim ullamco elit minim exercitation exercitation", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Fugiat consequat tempor sint ut officia eu do ea esse et in. Duis laboris est ut ea tempor labore ullamco velit fugiat laborum reprehenderit minim magna. Nulla amet ad ullamco non. Ullamco incididunt sunt incididunt nisi ad incididunt amet dolor non pariatur fugiat id Lorem. Aliquip incididunt labore deserunt deserunt ut et sit sint Lorem sint.\r\nAnim est minim est ipsum do. Deserunt quis nisi officia dolore est eu nulla incididunt. Incididunt laborum non veniam veniam exercitation est amet commodo esse consectetur velit culpa nulla dolore. Incididunt sint ad labore commodo. Tempor ea aliquip in Lorem minim. Consequat nisi cupidatat consequat consectetur. Dolore nulla eu nisi consequat ad deserunt velit culpa.\r\n", 
        "vente": 0, 
        "prix": 274, 
        "ref": "2f997e77-a275-4a39-a6df-7195c8d90a56", 
        "id": 44, 
        "stock": 8
    }, 
    {
        "item_category_id": 17, 
        "designation": "irure quis reprehenderit do aliquip reprehenderit irure", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Eiusmod ullamco sunt velit velit ut ea aliquip sit. Commodo ad non sint sunt cupidatat ad fugiat proident elit. Commodo ipsum sint eiusmod velit occaecat elit voluptate fugiat commodo cupidatat laboris ex dolor commodo. Dolor labore ad do occaecat eu. Quis exercitation anim labore id est ipsum proident. Tempor in excepteur proident Lorem nostrud amet occaecat cupidatat excepteur. Eiusmod cupidatat laborum amet ullamco adipisicing sunt laborum irure commodo nostrud.\r\nSunt est amet ea sint ad ad dolor. Laborum consequat mollit consectetur et minim esse dolor Lorem reprehenderit. Culpa exercitation ut fugiat adipisicing laboris et fugiat occaecat qui cupidatat amet fugiat. Laboris mollit in ea sunt excepteur ipsum et labore voluptate ad irure exercitation. Nostrud in nostrud fugiat est esse aliqua deserunt dolore officia amet quis enim nulla.\r\n", 
        "vente": 0, 
        "prix": 79, 
        "ref": "783e3fe2-e66c-4e3c-a4a5-5fb7168b83df", 
        "id": 45, 
        "stock": 30
    }, 
    {
        "item_category_id": 2, 
        "designation": "ut laborum minim irure ut velit aliqua", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Aliquip eu ea magna magna Lorem dolore aute est. Est velit consequat pariatur eiusmod do commodo nulla officia commodo ad deserunt. Id do consectetur et dolore incididunt sit quis tempor cupidatat anim. Adipisicing tempor labore Lorem do tempor aliquip velit sit nostrud nostrud. Eu officia duis laborum pariatur ad qui. Adipisicing reprehenderit pariatur sunt cillum. Incididunt cillum veniam nisi pariatur cupidatat sit.\r\nDolore ut ad commodo aliquip mollit minim nisi ex cillum consequat. Officia in quis Lorem exercitation eu consectetur aliquip exercitation excepteur laboris labore et aute. Laborum exercitation consequat laboris laborum nulla laborum non magna Lorem labore elit. Amet voluptate quis irure laboris laborum deserunt labore. Ad deserunt anim ipsum aliqua sunt esse eiusmod dolore magna mollit occaecat. Sint irure incididunt exercitation exercitation cillum pariatur laborum excepteur dolor est voluptate duis laboris. Laborum eiusmod eiusmod non dolor ad veniam dolore cupidatat laborum sunt.\r\n", 
        "vente": 0, 
        "prix": 228, 
        "ref": "11aed9d8-a8ea-4416-9d49-8bbe88cbef9a", 
        "id": 46, 
        "stock": 44
    }, 
    {
        "item_category_id": 3, 
        "designation": "tempor occaecat ex qui reprehenderit sit reprehenderit", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "In aliqua enim minim nulla id reprehenderit labore. Voluptate qui quis minim id enim anim dolor mollit. Elit dolor Lorem enim ullamco laborum aliqua et laborum ea officia. Eiusmod ullamco laborum nostrud fugiat veniam ad eu commodo adipisicing. Excepteur elit dolor nisi mollit ea. Mollit ullamco mollit incididunt amet incididunt ex consectetur cillum ad.\r\nCommodo tempor ad quis et consectetur dolor sit. Sunt duis proident aliquip voluptate eu incididunt ad labore consectetur velit. Ad elit ullamco tempor enim consequat exercitation nulla sunt commodo amet ullamco duis culpa. Qui voluptate duis dolore nisi consequat et exercitation sint. Commodo esse qui cillum nisi eu dolore consectetur cillum eiusmod commodo culpa labore ad velit.\r\n", 
        "vente": 0, 
        "prix": 153, 
        "ref": "515cbbd8-21c4-4178-a5d4-69a868379ed6", 
        "id": 47, 
        "stock": 4
    }, 
    {
        "item_category_id": 3, 
        "designation": "sunt duis aliqua proident est tempor incididunt", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Officia officia elit ipsum quis minim nostrud. Sit enim enim labore commodo veniam Lorem Lorem voluptate deserunt incididunt do. Consectetur magna cillum sint consequat aliquip et.\r\nCillum voluptate fugiat veniam mollit veniam qui qui. Sint officia in exercitation sit excepteur enim aute et aute. Lorem officia enim cupidatat culpa enim occaecat amet nostrud cillum exercitation proident laborum. Non nisi tempor sit consequat reprehenderit cillum incididunt incididunt pariatur. Laboris ad irure aute reprehenderit ea anim mollit aliqua ea sit ipsum. Laborum sunt minim mollit excepteur velit do exercitation culpa ipsum tempor cillum adipisicing officia aliqua.\r\n", 
        "vente": 0, 
        "prix": 394, 
        "ref": "336e7177-ca11-4b91-b67e-a4a3ac53545e", 
        "id": 48, 
        "stock": 28
    }, 
    {
        "item_category_id": 13, 
        "designation": "tempor voluptate deserunt amet laborum commodo voluptate", 
        "img": "http://placekitten.com/g/150/150", 
        "description": "Ad nulla irure officia velit ipsum mollit adipisicing ex deserunt nulla ipsum deserunt reprehenderit in. Incididunt sunt occaecat laboris est labore velit reprehenderit aute ut est. Laborum dolore do pariatur pariatur cupidatat mollit. Do cupidatat dolore ad sint nostrud duis eiusmod.\r\nIn anim veniam cillum occaecat eiusmod velit tempor nulla. Ut sunt velit fugiat ea est irure ad laborum duis. Do consequat ex tempor adipisicing labore exercitation.\r\n", 
        "vente": 0, 
        "prix": 9, 
        "ref": "81fe1d49-3d42-497f-bda4-06511a6440b2", 
        "id": 49, 
        "stock": 12
    }
]